# Machine Learning Foundation

## Section 1, Part b: Reading Data Lab

In [19]:
import sqlite3 as sq3
import pandas.io.sql as pds
import pandas as pd

## Lab Exercise: Reading in database files

 - Create a variable, `path`, containing the path to the `baseball.db` contained in `data/`
 - Create a connection, `con`, that is connected to database at `path`
 - Create a variable, `query`, containing a SQL query which reads in all data from the `allstarfull` table
 - Create a variable, `allstar_data`, by using pandas' [read_sql](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_sql.html?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMML0232ENSkillsNetwork837-2023-01-01)

### Optional
 - Create a variable, `tables`, which reads in all data from the table `sqlite_master`
 - Pretend that you were interesting in creating a new baseball hall of fame. Join and analyze the tables to evaluate the top 3 all time best baseball players.

In [20]:
### BEGIN SOLUTION

# Create a variable, `path`, containing the path to the `baseball.db` contained in `data/`
path = 'data/baseball.db'

# Create a connection, `con`, that is connected to database at `path`
con = sq3.Connection(path)

# Create a variable, `query`, containing a SQL query which reads in all data from the `allstarfull` table
query = '''
SELECT * FROM allstarfull;
'''

# Create a variable, `allstar_data`, by using pandas' [read_sql]
allstar_data = pds.read_sql(query, con)

### For Optional Section
# Create a variable, tables, which reads in all data from the table sqlite_master
tables = pds.read_sql('SELECT * FROM sqlite_master;', con)


# Pretend that you were interesting in creating a new baseball hall of fame. Join and analyze the tables to evaluate the top 3 all time best baseball players.
best_query = '''
SELECT playerID, sum(Gp) AS num_games_played, AVG(startingPos) AS avg_starting_position
    FROM allstarfull
    GROUP BY playerID
    ORDER BY num_games_played DESC, avg_starting_position ASC
    LIMIT 3
'''
best = pds.read_sql(best_query, con)

In [21]:
allstar_data

      index   playerID  yearID  gameNum  ... teamID lgID   GP  startingPos
0         0  gomezle01    1933        0  ...    NYA   AL  1.0          1.0
1         1  ferreri01    1933        0  ...    BOS   AL  1.0          2.0
2         2  gehrilo01    1933        0  ...    NYA   AL  1.0          3.0
3         3  gehrich01    1933        0  ...    DET   AL  1.0          4.0
4         4  dykesji01    1933        0  ...    CHA   AL  1.0          5.0
...     ...        ...     ...      ...  ...    ...  ...  ...          ...
5143   5143  seageco01    2016        0  ...    LAN   NL  1.0          NaN
5144   5144  strasst01    2016        0  ...    WAS   NL  0.0          NaN
5145   5145  syndeno01    2016        0  ...    NYN   NL  0.0          NaN
5146   5146  teherju01    2016        0  ...    ATL   NL  1.0          NaN
5147   5147  zobribe01    2016        0  ...    CHN   NL  1.0          4.0

[5148 rows x 9 columns]

In [22]:
tables

    type  ...                                                sql
0  table  ...  CREATE TABLE "allstarfull" (\n"index" INTEGER,...
1  index  ...  CREATE INDEX "ix_allstarfull_index"ON "allstar...
2  table  ...  CREATE TABLE "schools" (\n"index" INTEGER,\n  ...
3  index  ...  CREATE INDEX "ix_schools_index"ON "schools" ("...
4  table  ...  CREATE TABLE "batting" (\n"index" INTEGER,\n  ...
5  index  ...  CREATE INDEX "ix_batting_index"ON "batting" ("...

[6 rows x 5 columns]

In [23]:
best

    playerID  num_games_played  avg_starting_position
0  musiast01              24.0               6.357143
1   mayswi01              24.0               8.000000
2  aaronha01              24.0               8.470588

## END SOLUTION